TMT4869/Bootloader/source/MKE16Z4_HAL_Driver/Driver_Src/mke16z4_lpuart.c
/******************************************************************************
 * INCLUDES
 ******************************************************************************/
#include "mke16z4_hal_lpuart.h"
#include "mke16z4_lpuart.h"
#include "mke16z4_clock.h"
#include "mke16z4_core.h"
#include "mke16z4_def.h"
#include <assert.h>
/******************************************************************************
 * PRIVATE TYPEDEF
 ******************************************************************************/

/******************************************************************************
 * PRIVATE CONSTANTS
 ******************************************************************************/

/******************************************************************************
 * PRIVATE MACROS
 ******************************************************************************/

/******************************************************************************
 * PRIVATE VARIABLES
 ******************************************************************************/
/* LPUARTx arrays */
static LPUART_Type *const lpuartPtrs[LPUART_TOTAL_INSTANCES] = LPUART_BASE_PTRS;
/* LPUART IRQ numbers */
static const IRQn_Type LPUART_IRQn[LPUART_TOTAL_INSTANCES] = {LPUART0_IRQn, LPUART1_IRQn, LPUART2_IRQn};
/* Data mask for each word length type ( 6bit to 10bit )*/
static const uint16_t wordLengthMask[5U] = {0x003F, 0x007F, 0x00FF, 0x01FF, 0x03FF};
/* LPUART Handles (one for each instance) */
static LPUART_HandleTypeDef *LPUART_DriverHandles[LPUART_TOTAL_INSTANCES];
/******************************************************************************
 * PRIVATE FUNCTIONS PROTOTYPES
 ******************************************************************************/
static int16_t LPUSART_InstanceToPCC(LPUART_Type *LPUARTx);
static void LPUART_BaudRateMatchConfig(LPUART_Type *LPUARTx, uint32_t BaudRate);
static DRV_StatusTypeDef LPUART_WaitForFlag(LPUART_Type *LPUARTx,\
                                         uint32_t UART_FLAG,\
                                         FlagStatus flagStatus,\
                                         const uint32_t timeLimit);
/* Process Transmitting and Receiving */
static DRV_StatusTypeDef LPUART_Receive_Interrupt(LPUART_HandleTypeDef *LPUART_Handle);
static DRV_StatusTypeDef LPUART_Transmit_Interrupt(LPUART_HandleTypeDef *LPUART_Handle);
static DRV_StatusTypeDef LPUART_TransmitComplete_Interrupt(LPUART_HandleTypeDef *LPUART_Handle);
/* Default IRQ handler for LPUART and function pointers */
static void LPUART_Default_IRQHandler(void);
/* Function pointers */
static void (*pISR_LPUART0_Callback)(void) = LPUART_Default_IRQHandler;
static void (*pISR_LPUART1_Callback)(void) = LPUART_Default_IRQHandler;
static void (*pISR_LPUART2_Callback)(void) = LPUART_Default_IRQHandler;
/******************************************************************************
 * PRIVATE FUNCTIONS
 ******************************************************************************/

/**
 * @brief Initialize LPUART Peripheral
 * @param LPUART_Handle:LPUART Handle
 * @param Priority: interrupt priority
 * @retval None
 */
void LPUART_Init(LPUART_HandleTypeDef *LPUART_Handle, uint32_t Priority)
{
    uint32_t uartClock   = 0x00;
    uint32_t tmpOvrsampl = 0x00;
    uint32_t tmpDivisor  = 0x00;
    LPUART_Type* LPUARTx = NULL;
    /* Busy state (configuring), TxState is also used for global state of UART */
    LPUART_Handle->TxState = UART_STATE_BUSY;
    /* Check parameters */
    assert(IS_UART_ALL_INSTANCE(LPUART_Handle->DRIVER_LPUARTx));
    assert(IS_UART_MODE(LPUART_Handle->Init.Mode));
    assert(IS_UART_PARITY(LPUART_Handle->Init.Parity));
    assert(IS_UART_STOPBITS(LPUART_Handle->Init.StopBits));
    assert(IS_UART_OVERSAMPLING(LPUART_Handle->Init.OverSampling));
    assert(IS_USART_BAUDRATE(LPUART_Handle->Init.BaudRate));
    assert(IS_UART_WORD_LENGTH(LPUART_Handle->Init.WordLength));
    assert(IS_NVIC_PRIORITY(Priority));
    /* Get instance */
    LPUARTx = lpuartPtrs[LPUART_Handle->DRIVER_LPUARTx];
    /* Disable transmitter and receiver */
    __HAL_LPUART_DISABLE(LPUARTx);
    /* Configure oversampling, baud clock divisor, stop bits and M10 */
        /* 1. M10 (10 data bits) */
    __HAL_LPUART_10BIT_DATA_DISABLE(LPUARTx);
    if (LPUART_Handle->Init.WordLength == UART_WORDLENGTH_10B)
    {
        __HAL_LPUART_10BIT_DATA_ENABLE(LPUARTx);
    }
        /* 2. Stop bits (SBNS) */
    __HAL_LPUART_STOPBITS_CONFIG(LPUARTx, LPUART_Handle->Init.StopBits);
    if (LPUART_Handle->Init.OverSampling == UART_OVERSAMPLING_AUTO)
    {
        LPUART_BaudRateMatchConfig(LPUARTx, LPUART_Handle->Init.BaudRate);
    }
    else
    {
        /* 3. Oversampling ratio (OSR) */
        __HAL_LPUART_OVERSAMPLING_CONFIG(LPUARTx, LPUART_Handle->Init.OverSampling);
        __HAL_LPUART_SAMPLING_BOTHEDGE_DISABLE(LPUARTx);
        /* 4. Baud clock divisor (SBR) */
            /* a. Get asyncrhonous clock of baud rate clock */
        uartClock = PCC_GetAsyncClock(LPUSART_InstanceToPCC(LPUARTx));
            /* b. Oversampling ratio */
        tmpOvrsampl = LPUART_Handle->Init.OverSampling + 1U;
        if ((tmpOvrsampl > UART_OVERSAMPLING_4) && (tmpOvrsampl < UART_OVERSAMPLING_9))
        {
            __HAL_LPUART_SAMPLING_BOTHEDGE_ENABLE(LPUARTx);
        }
            /* c. Modulus divier */
        tmpDivisor = (uint32_t)uartClock /(LPUART_Handle->Init.BaudRate * tmpOvrsampl);
            /* d. Choose the closer value */
        if (tmpDivisor == 0)
        {
            tmpDivisor = 1U;
        }
        else if ((uartClock - tmpDivisor * tmpOvrsampl * LPUART_Handle->Init.BaudRate) \
          > ((tmpDivisor + 1U) * tmpOvrsampl * LPUART_Handle->Init.BaudRate - uartClock))
        {
            tmpDivisor = tmpDivisor + 1U;
        }
        else
        {
            /* Avoid MISRA C violation */
        }
            /* d .Config SBR */
        __HAL_LPUART_BAUDRATE_DIVISOR_CONFIG(LPUARTx, tmpDivisor);
    }
    /* Configure parity, word length, loop mode */
        /* 1. Word length */
    if (LPUART_Handle->Init.WordLength == UART_WORDLENGTH_9B)
    {
        __HAL_LPUART_7BIT_DATA_DISABLE(LPUARTx);
        __HAL_LPUART_9BIT_DATA_ENABLE(LPUARTx);
    }
    else if (LPUART_Handle->Init.WordLength == UART_WORDLENGTH_7B)
    {
        __HAL_LPUART_9BIT_DATA_DISABLE(LPUARTx);
        __HAL_LPUART_7BIT_DATA_ENABLE(LPUARTx);
    }
    else /* Default 8bit data or 10bit data */
    {
        __HAL_LPUART_9BIT_DATA_DISABLE(LPUARTx);
        __HAL_LPUART_7BIT_DATA_DISABLE(LPUARTx);
    }
        /* 2. Parity */
    __HAL_LPUART_PARITY_CONFIG(LPUARTx, LPUART_Handle->Init.Parity);
        /* 3. Loop mode config */
    if ((LPUART_Handle->Init.Mode == UART_MODE_LOOPBACK) || \
        (LPUART_Handle->Init.Mode == UART_MODE_HALFDUPLEX))
    {
        __HAL_LPUART_LOOPMODE_CONFIG(LPUARTx,LPUART_Handle->Init.Mode);
    }
    /* Enable Tx or Rx or both */
    if (LPUART_Handle->Init.Mode & UART_MODE_RX)
    {
        __HAL_LPUART_RX_ENABLE(LPUARTx);
    }
    if (LPUART_Handle->Init.Mode & UART_MODE_TX)
    {
        __HAL_LPUART_TX_ENABLE(LPUARTx);
    }
    /* Initialize function pointers */
    LPUART_Handle->ErrorCallback = NULL;
    LPUART_Handle->RxFinishCallback = NULL;
    LPUART_Handle->TxFinishCallback = NULL;
    /* Make state to ready (can receive or send data) */
    LPUART_Handle->TxState = UART_STATE_READY;
    LPUART_Handle->RxState = UART_STATE_READY;
    /* NVIC config */
    NVIC_SetPriority(LPUART_IRQn[LPUART_Handle->DRIVER_LPUARTx], Priority);
    NVIC_DisableIRQ(LPUART_IRQn[LPUART_Handle->DRIVER_LPUARTx]);
    NVIC_EnableIRQ(LPUART_IRQn[LPUART_Handle->DRIVER_LPUARTx]);
    NVIC_ClearPendingIRQ(LPUART_IRQn[LPUART_Handle->DRIVER_LPUARTx]);
    /* Assign user handle to driver handle */
    LPUART_DriverHandles[LPUART_Handle->DRIVER_LPUARTx] = LPUART_Handle;
}

/**
 * @brief  Start transmit with LPUART by interrupts
 * @param  LPUART_Handle: Handle
 * @param  pData:pointer to data
 * @param  DataSize: data size
 * @retval None
 */
DRV_StatusTypeDef LPUART_Start_Transmit_Interrupt (LPUART_HandleTypeDef *LPUART_Handle,\
                                      const uint8_t *pData,\
                                      const uint32_t DataSize)
{
    LPUART_Type *LPUARTx = lpuartPtrs[LPUART_Handle->DRIVER_LPUARTx];
    DRV_StatusTypeDef status = DRV_ERROR_NONE;
    if ((pData == NULL) || (DataSize == 0))
    {
        status = DRV_ERROR;
    }
    else if (LPUART_Handle->TxState == UART_STATE_READY)
    {
        /* Set state to busy */
        LPUART_Handle->TxState  = UART_STATE_BUSY_TX;
        /* Configure the transmition data */
        LPUART_Handle->TxBuffer = pData;
        LPUART_Handle->TxCount  = DataSize;
        /* Enable interrupt */
        __HAL_LPUART_INTRPT_ENABLE(LPUARTx, UART_INTRPT_TXEMPTY);
        /* Configuration finished */
        status = DRV_ERROR_NONE;
    }
    else
    {
        status = DRV_BUSY;
    }
    return status;
}

/**
 * @brief  Start receiving with LPUART
 * @param  LPUART_Handle: Handle
 * @param  pData:pointer to data
 * @param  DataSize: data size
 * @retval None
 */
DRV_StatusTypeDef LPUART_Start_Receive_Interrupt(LPUART_HandleTypeDef *LPUART_Handle,\
                                          uint8_t *pData,\
                                          const uint32_t DataSize)
{
    LPUART_Type *LPUARTx = lpuartPtrs[LPUART_Handle->DRIVER_LPUARTx];
    DRV_StatusTypeDef status = DRV_ERROR_NONE;
    if ((pData == NULL) || (DataSize == 0))
    {
        status = DRV_ERROR;
    }
    else if (LPUART_Handle->RxState == UART_STATE_READY)
    {
        /* Set state to busy */
        LPUART_Handle->RxState = UART_STATE_BUSY_RX;
        /* Configure the transmition data */
        LPUART_Handle->RxBuffer = pData;
        LPUART_Handle->RxCount = DataSize;
        /* Enable error interrupts */
        __HAL_LPUART_INTRPT_ENABLE(LPUARTx, UART_INTRPT_FRAMEERR | \
                                        UART_INTRPT_OVERRUN | \
                                        UART_INTRPT_NOISEERR | \
                                        UART_INTRPT_PARITYERR);
        /* Enable interrupt to start receving data */
        __HAL_LPUART_INTRPT_ENABLE(LPUARTx, UART_INTRPT_RXFULL);
        /* Configuration finished */
        status = DRV_ERROR_NONE;
    }
    else
    {
        status = DRV_BUSY;
    }
    return status;
}

/**
 * @brief  Abort or stop waiting to receive data from UART
 * @param  LPUART_Handle: Handle
 * @retval None
 */
void LPUART_AbortReceive_Interrupt(LPUART_HandleTypeDef *LPUART_Handle)
{
    LPUART_Type *LPUARTx = lpuartPtrs[LPUART_Handle->DRIVER_LPUARTx];
    /* Disable error interrupts and RDRF interrupt */
        /* Errors */
    __HAL_LPUART_INTRPT_DISABLE(LPUARTx, UART_INTRPT_FRAMEERR | UART_INTRPT_OVERRUN | UART_INTRPT_NOISEERR | UART_INTRPT_PARITYERR);
        /* Receive Buffer Full */
    __HAL_LPUART_INTRPT_DISABLE(LPUARTx, UART_INTRPT_RXFULL);
    /* Reset counter */
    LPUART_Handle->RxCount = 0x00;
    /* Set state to ready */
    LPUART_Handle->RxState = UART_STATE_READY;
}

/**
 * @brief  Start transmitting data from LPUART by polling
 */
DRV_StatusTypeDef LPUART_Transmit_Polling(LPUART_HandleTypeDef *LPUART_Handle,\
                                          const uint8_t *pData, \
                                          const uint32_t DataSize, \
                                          const uint32_t TimeLimit)
{
    LPUART_Type      *LPUARTx  = lpuartPtrs[LPUART_Handle->DRIVER_LPUARTx];
    DRV_StatusTypeDef status   = DRV_ERROR_NONE;
    uint16_t          tempData = 0x00;
    uint16_t dataMask = wordLengthMask[LPUART_Handle->Init.WordLength - (LPUART_Handle->Init.Parity != UART_PARITY_NO)];
    if ((pData == NULL) || (DataSize == 0))
    {
        status = DRV_ERROR;
    }
    else if (LPUART_Handle->TxState == UART_STATE_READY)
    {
        /* Set state to busy */
        LPUART_Handle->TxState = UART_STATE_BUSY_TX;
        /* Configure the transmition data */
        LPUART_Handle->TxBuffer = pData;
        LPUART_Handle->TxCount = DataSize;
        while ((LPUART_Handle->TxCount-- != 0) && (status == DRV_ERROR_NONE))
        {
            if (LPUART_WaitForFlag(LPUARTx, UART_FLAG_TXBUFFEREMPTY, SET, TimeLimit) == DRV_TIMEOUT)
            {
                status = DRV_TIMEOUT;
            }
            else
            {
                if ((LPUART_Handle->Init.WordLength == UART_WORDLENGTH_10B)
                || (LPUART_Handle->Init.WordLength == UART_WORDLENGTH_9B) && (LPUART_Handle->Init.Parity == UART_PARITY_NO))
                {
                    tempData = ((uint16_t)(*LPUART_Handle->TxBuffer)) | (uint16_t) (*(LPUART_Handle->TxBuffer + 1U) << 8U);
                    __HAL_LPUART_WRITE_DATA_BUFFER(LPUARTx, tempData & dataMask);
                    LPUART_Handle->TxBuffer += 2U;
                }
                else
                {
                    __HAL_LPUART_WRITE_DATA_BUFFER(LPUARTx, (*LPUART_Handle->TxBuffer) & (uint8_t)dataMask);
                    LPUART_Handle->TxBuffer += 1U;
                }
            }
        }
        /* Wait for Tranmission Complete Flag (TCIE) */
        if (LPUART_WaitForFlag(LPUARTx, UART_FLAG_TXCOMPLETE, SET, TimeLimit) == DRV_TIMEOUT)
        {
            status = DRV_TIMEOUT;
        }
        /* Release Tx */
        LPUART_Handle->TxState = UART_STATE_READY;
    }
    else
    {
        status = DRV_BUSY;
    }
    return status;
}

/**
 * @brief Start receiving data from LPUART by polling
 */
DRV_StatusTypeDef LPUART_Receive_Polling(LPUART_HandleTypeDef *LPUART_Handle, \
                                         uint8_t *pData, \
                                         const uint32_t DataSize, \
                                         const uint32_t TimeLimit)
{
    LPUART_Type      *LPUARTx      = lpuartPtrs[LPUART_Handle->DRIVER_LPUARTx];
    DRV_StatusTypeDef status       = DRV_ERROR_NONE;
    uint8_t          *pTempData    = NULL;
    uint16_t          receivedData = 0x00;
    uint16_t dataMask = wordLengthMask[LPUART_Handle->Init.WordLength - (LPUART_Handle->Init.Parity != UART_PARITY_NO)];
    if ((pData == NULL) || (DataSize == 0))
    {
        status = DRV_ERROR;
    }
    else if (LPUART_Handle->RxState == UART_STATE_READY)
    {
        /* Set state to busy */
        LPUART_Handle->RxState = UART_STATE_BUSY_RX;
        /* Configure the transmition data */
        LPUART_Handle->RxBuffer = pData;
        LPUART_Handle->RxCount  = DataSize;
        while ((LPUART_Handle->RxCount-- != 0) && (status == DRV_ERROR_NONE))
        {
            if (LPUART_WaitForFlag(LPUARTx, UART_FLAG_RXBUFFERFULL, SET, TimeLimit) == DRV_TIMEOUT)
            {
                status = DRV_TIMEOUT;
            }
            else
            {
                /*  Check data size and read data into buffer */
                if ((LPUART_Handle->Init.WordLength == UART_WORDLENGTH_10B)
                || (LPUART_Handle->Init.WordLength == UART_WORDLENGTH_9B) && (LPUART_Handle->Init.Parity == UART_PARITY_NO))
                {
                    receivedData = (uint16_t)(__HAL_LPUART_READ_DATA_BUFFER(LPUARTx) & dataMask);
                    /* Save first byte of data */
                    *pTempData = (uint8_t)receivedData;
                    /* Save remaning bits */
                    *(pTempData + 1U) = (uint8_t)(receivedData >> 8U);
                    LPUART_Handle->RxBuffer += 2U;
                }
                else
                {
                    *pTempData = (uint8_t)(__HAL_LPUART_READ_DATA_BUFFER(LPUARTx) & dataMask);
                    LPUART_Handle->RxBuffer += 1U;
                }
            }
        }
        LPUART_Handle->RxState = UART_STATE_READY;
    }
    else
    {
        status = DRV_BUSY;
    }
    return status;
}

static DRV_StatusTypeDef LPUART_WaitForFlag(LPUART_Type *LPUARTx,\
                                         uint32_t UART_FLAG,\
                                         FlagStatus flagStatus,\
                                         const uint32_t timeLimit)
{
    DRV_StatusTypeDef drvStatus = DRV_ERROR_NONE;
    uint32_t startTicks;
    /* SysTick is not yet initialized */
    if (SysTick_GetFrequency() == 0)
    {
        SysTick_Init(SYSTICK_1000HZ_FREQ, NVIC_PRIORITY_0);
    }

